# Metadata
author: Jordan-Pierce
task: detect
keywords: [cnn, efficientnet]
description: EfficientNet-B0 pretrained backbone with Detect head.
flops: 24.0
parameters: 8881551
min_version: 8.3.59
discussion: https://github.com/Jordan-Pierce/community/discussions/1

# Model
nc: 1
strides: [8, 16, 32]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [1280, efficientnet_b0, DEFAULT, True, 2, True]]
  - [0, 1, Index, [32, 4]]    # (1, 32, 80, 80) - 1
  - [0, 1, Index, [112, 6]]   # (1, 112, 40, 40) - 2
  - [0, 1, Index, [1280, 8]]  # (1, 1280, 20, 20) - 3
head:
  - [[1, 2, 3], 1, Detect, [nc]]