# Metadata
author: Y-T-G
task: detect
keywords: [cnn, yolo11, small-object]
description: YOLO11 object detection model with an extra P2 scale for small object detecton.
flops:
  n: 11.4
  s: 29.7
  m: 88.9
  l: 113.6
  x: 245.1
parameters:
  n: 2740032
  s: 9625968
  m: 20591120
  l: 26116368
  x: 57849456
min_version: 8.3.0
discussion: https://github.com/Y-T-G/community/discussions/60

# Model
nc: 80
strides: [4, 8, 16, 32]
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512] 
  x: [1.00, 1.50, 512] 

backbone:
  # Stem
  - [-1, 1, Conv, [64, 3, 2]]                   # (1, 64, 320, 320) - 0

  # P2 Backbone
  - [-1, 1, Conv, [128, 3, 2]]                  # (1, 128, 160, 160) - 1
  - [-1, 2, C3k2, [256, False, 0.25]]           # (1, 256, 160, 160) - 2

  # P3 Backbone
  - [-1, 1, Conv, [256, 3, 2]]                  # (1, 256, 80, 80) - 3
  - [-1, 2, C3k2, [512, False, 0.25]]           # (1, 512, 80, 80) - 4

  # P4 Backbone
  - [-1, 1, Conv, [512, 3, 2]]                  # (1, 512, 40, 40) - 5
  - [-1, 2, C3k2, [512, True]]                  # (1, 512, 40, 40) - 6

  # P5 Backbone
  - [-1, 1, Conv, [1024, 3, 2]]                 # (1, 512, 20, 20) - 7
  - [-1, 2, C3k2, [1024, True]]                 # (1, 512, 20, 20) - 8
  - [-1, 1, SPPF, [1024, 5]]                    # (1, 512, 20, 20) - 9
  - [-1, 2, C2PSA, [1024]]                      # (1, 512, 20, 20) - 10

head:
  # Top-Down Path (Feature Pyramid)
  # P4 Head
  - [-1, 1, nn.Upsample, [None, 2, nearest]]    # (1, 512, 40, 40) - 11
  - [[-1, 6], 1, Concat, [1]]                   # (1, 1024, 40, 40) - 12
  - [-1, 2, C3k2, [512, False]]                 # (1, 512, 40, 40) - 13

  # P3 Head
  - [-1, 1, nn.Upsample, [None, 2, nearest]]    # (1, 512, 80, 80) - 14
  - [[-1, 4], 1, Concat, [1]]                   # (1, 1024, 80, 80) - 15
  - [-1, 2, C3k2, [256, False]]                 # (1, 256, 80, 80) - 16

  # P2 Head
  - [-1, 1, nn.Upsample, [None, 2, nearest]]    # (1, 256, 160, 160) - 17
  - [[-1, 2], 1, Concat, [1]]                   # (1, 512, 160, 160) - 18
  - [-1, 2, C3k2, [128, False]]                 # (1, 128, 160, 160) - 19

  # Bottom-Up Path (PAN-FPN)
  # P3
  - [-1, 1, Conv, [128, 3, 2]]                  # (1, 128, 80, 80) - 20
  - [[-1, 16], 1, Concat, [1]]                  # (1, 384, 80, 80) - 21
  - [-1, 2, C3k2, [256, False]]                 # (1, 256, 80, 80) - 22

  # P4
  - [-1, 1, Conv, [256, 3, 2]]                  # (1, 256, 40, 40) - 23
  - [[-1, 13], 1, Concat, [1]]                  # (1, 768, 40, 40) - 24
  - [-1, 2, C3k2, [512, False]]                 # (1, 512, 40, 40) - 25

  # P5
  - [-1, 1, Conv, [512, 3, 2]]                  # (1, 512, 20, 20) - 26
  - [[-1, 10], 1, Concat, [1]]                  # (1, 1024, 20, 20) - 27
  - [-1, 2, C3k2, [1024, True]]                 # (1, 512, 20, 20) - 28

  # Detection Head (P2, P3, P4, P5)
  - [[19, 22, 25, 28], 1, Detect, [nc]]         # 29
