# Metadata
author: Y-T-G
task: classify
keywords: [cnn, convnext]
description: ConvNeXt-Tiny pretrained backbone with Classify head.
flops: 73.7
parameters: 28805473
min_version: 8.3.59
discussion: https://github.com/Y-T-G/community/discussions/13

# Model
nc: 1
strides: [32]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, convnext_tiny, DEFAULT, True, 2]]  # (1, 768, 20, 20) - 0

head:
  - [-1, 1, Classify, [nc]]